Revit 2027 API
BuiltInFailures.CreationFailures.CannotCreateCorniceIntegralWarn Property
 Could not create integral wall sweep for wall instance. [Description]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateCorniceIntegralWarn { get; }
Public Shared ReadOnly Property CannotCreateCorniceIntegralWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateCorniceIntegralWarn {
	FailureDefinitionId^ get ();
}
static member CannotCreateCorniceIntegralWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace